# PointRelativeToPoint Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointRelativeToPoint Class
Members See Also
---
Represents a point placed relative to another point.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class PointRelativeToPoint : PointElementReference
```

Visual Basic
---
```text
Public Class PointRelativeToPoint _
	Inherits PointElementReference
```

Visual C++
---
```text
public ref class PointRelativeToPoint : public PointElementReference
```

# Remarks
For this release, the only workflow supported is that the point is placed coincident with the referenced host (a relative transformation of Transform.Identity).
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..PointElementReference Autodesk.Revit.DB..::..PointRelativeToPoint
# See Also
PointRelativeToPoint Members
Autodesk.Revit.DB Namespace